Revit 2017 API
StructuralSectionCProfileWithFold.LipLength Property
 Lip segment length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public double LipLength { get; set; }
Visual Basic
Public Property LipLength As Double
	Get
	Set
Visual C++
public:
property double LipLength {
	double get ();
	void set (double value);
}
See Also
StructuralSectionCProfileWithFold Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace